{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v3.3.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                5,
                4
              ],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "LSTM_1",
              "trainable": true,
              "batch_input_shape": [
                null,
                5,
                4
              ],
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 64,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "LSTM_2",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": true,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 128,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "LSTM",
            "config": {
              "name": "LSTM_3",
              "trainable": true,
              "dtype": "float32",
              "return_sequences": false,
              "return_state": false,
              "go_backwards": false,
              "stateful": false,
              "unroll": false,
              "time_major": false,
              "units": 256,
              "activation": "tanh",
              "recurrent_activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "recurrent_initializer": {
                "class_name": "Orthogonal",
                "config": {
                  "gain": 1.0,
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "unit_forget_bias": true,
              "kernel_regularizer": null,
              "recurrent_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "recurrent_constraint": null,
              "bias_constraint": null,
              "dropout": 0.0,
              "recurrent_dropout": 0.0,
              "implementation": 2
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "Dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "Dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "Dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 20,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Reshape",
            "config": {
              "name": "output",
              "trainable": true,
              "dtype": "float32",
              "target_shape": [
                5,
                4
              ]
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "mean_squared_error",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "acc",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "Adam",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "epsilon": 1e-07,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "Dense_1/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "Dense_1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "Dense_2/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "Dense_2/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "Dense_3/kernel",
          "shape": [
            64,
            20
          ],
          "dtype": "float32"
        },
        {
          "name": "Dense_3/bias",
          "shape": [
            20
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_1/lstm_cell/kernel",
          "shape": [
            4,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_1/lstm_cell/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_1/lstm_cell/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_2/lstm_cell_1/kernel",
          "shape": [
            64,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_2/lstm_cell_1/recurrent_kernel",
          "shape": [
            128,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_2/lstm_cell_1/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_3/lstm_cell_2/kernel",
          "shape": [
            128,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_3/lstm_cell_2/recurrent_kernel",
          "shape": [
            256,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_3/lstm_cell_2/bias",
          "shape": [
            1024
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}